---
kind: method
id: M:Autodesk.Revit.DB.View.CreateViewTemplate
zh: 视图
source: html/84f4d0e3-ae49-c2f8-d7d3-53d120fe3223.htm
---
# Autodesk.Revit.DB.View.CreateViewTemplate Method

**中文**: 视图

Creates a new view template instance from this view instance.

## Syntax (C#)
```csharp
public View CreateViewTemplate()
```

## Returns
New view template instance

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The view is not valid for view template creation.